<html>

<head>
    <title> Ementa Engenharia </title>
</head>

<body>
    <h1 align="center">
        Ementa Engenharia de Software
    </h1>
    <hr size=7 color="black">
    <p align="center">
        <img src="monitor-edit-sem-fundo.png" border="black">
    </p><br>

    <ul align="center">
        <li>
            <a href="#p1">
                <font color="red">1</font> Per&iacute;odo
            </a>
        </li>
        <li>
            <a href="#p2">
                <font color="red">2</font> Per&iacute;odo
            </a>
        </li>
        <li>
            <a href="#p3">
                <font color="red">3</font> Per&iacute;odo
            </a>
        </li>
        <li>
            <a href="#p4">
                <font color="red">4</font> Per&iacute;odo
            </a>
        </li>
        <li>
            <a href="#p5">
                <font color="red">5</font> Per&iacute;odo
            </a>
        </li>
        <li>
            <a href="#p6">
                <font color="red">6</font> Per&iacute;odo
            </a>
        </li>
        <li>
            <a href="#p7">
                <font color="red">7</font> Per&iacute;odo
            </a>
        </li>
        <li>
            <a href="#p8">
                <font color="red">8</font> Per&iacute;odo
            </a>
        </li>
        <li>
            <a href="#optativa">
                <font color="red">O</font>ptativas
            </a>
        </li>
    </ul>

    <br>
    <br>
    <br>
    <br>

    <p align="center" id="p1">
        <font size=7 color="red">1 Per&iacute;odo</font>
        <hr width="50%" size=7 color="black">
    <p align="center">
        <img src="img1.webp">
    </p>

    <ul align="center" type="none">
        <li>
            <font size=5>L&iacute;ngua Inglesa I</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Estrat&eacute;gias de leitura de textos com l&eacute;xico computacional:
                        infer&ecirc;ncias a partir da an&aacute;lise de<br>
                        t&iacute;tulos, gr&aacute;ficos, ilustra&ccedil;&otilde;es, acionamento do conhecimento
                        pr&eacute;vio sobre o tema, vocabul&aacute;rio cognato e<br>
                        o significado do vocabul&aacute;rio desconhecido a partir do contexto.
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>&Eacute;tica, Normas e Postura Profissional</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: No&ccedil;&otilde;es de &Eacute;tica. Implica&ccedil;&otilde;es &eacute;ticas da
                        profiss&atilde;o, assim como a regulamenta&ccedil;&atilde;o e atua&ccedil;&atilde;o do<br>
                        Engenheiro de Software, abordando os aspectos legais vigentes no pa&iacute;s:
                        legisla&ccedil;&atilde;o para crimes virtuais<br>
                        de invas&otilde;es de sistemas de informa&ccedil;&otilde;es e roubos de propriedade intelectual,
                        Lei do Software, Direito<br>
                        Autoral e Patentes. Responsabilidade profissional e consequentemente o compromisso social com
                        a<br>
                        inclus&atilde;o digital. Direitos Humanos. Rela&ccedil;&otilde;es &eacute;tnico raciais. O papel
                        do idoso na sociedade. &Eacute;tica e<br>
                        cidadania no mundo do trabalho. Educa&ccedil;&atilde;o ambiental.
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Matem&aacute;tica Discreta</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Aplica&ccedil;&atilde;o de conceitos da Matem&aacute;tica Discreta como ferramenta para
                        investiga&ccedil;&otilde;es e<br>
                        aplica&ccedil;&otilde;es precisas em computa&ccedil;&atilde;o. Instrumentaliza&ccedil;&atilde;o
                        do aluno para a aplica&ccedil;&atilde;o dos conceitos<br>
                        matem&aacute;ticos. Familiariza&ccedil;&atilde;o com a escrita matem&aacute;tica formal e com a
                        linguagem computacional.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Sistemas Digitais</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Sistemas de Numera&ccedil;&atilde;o e L&oacute;gica Booleana. Introdu&ccedil;&atilde;o
                        &agrave; L&oacute;gica Combinacional e<br>
                        Aplica&ccedil;&otilde;es. Introdu&ccedil;&atilde;o &agrave; L&oacute;gica Sequencial e
                        Aplica&ccedil;&otilde;es. Registradores de deslocamento. Introdu&ccedil;&atilde;o<br>
                        aos Contadores Conversores A/D e D/A.
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Introdu&ccedil;&atilde;o &agrave; Programa&ccedil;&atilde;o</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Reconhecimento de t&eacute;cnicas de registro de informa&ccedil;&otilde;es em arquivos.
                        Constru&ccedil;&atilde;o e integra&ccedil;&atilde;o<br>
                        dos m&oacute;dulos (Sub-rotinas). Aplica&ccedil;&atilde;o de t&eacute;cnicas de
                        programa&ccedil;&atilde;o estruturada. Codifica&ccedil;&atilde;o de<br>
                        algoritmos em linguagens de programa&ccedil;&atilde;o de alto n&iacute;vel. T&eacute;cnicas de
                        elabora&ccedil;&atilde;o de algoritmo.<br>
                        Opera&ccedil;&otilde;es usando &aacute;lgebra de booleana. Estruturas de loop em
                        solu&ccedil;&otilde;es de problemas. Estruturas de<br>
                        decis&atilde;o. Manipula&ccedil;&atilde;o de String.
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Comunica&ccedil;&atilde;o e Express&atilde;o</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Leitura e escritura de textos em seus diversos g&ecirc;neros. Reconhecimento das
                        variedades<br>
                        lingu&iacute;sticas. Reda&ccedil;&atilde;o oficial e acad&ecirc;mica. Orat&oacute;ria.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Introdu&ccedil;&atilde;o &agrave; Engenharia de Software</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Vis&atilde;o Geral do Curso de Engenharia de Software. Introdu&ccedil;&atilde;o a
                        Engenharia de software.<br>
                        Defini&ccedil;&atilde;o de sistema, software e Engenharia de Software. &Aacute;reas do
                        conhecimento da Engenharia de<br>
                        Software. Ferramentas.
                    </p>
                </li>
            </ul>
        </li>
    </ul>
    </p>

    <br>
    <br>
    <br>
    <p align="center" id="p2">
        <font size=7 color="red">2 Per&iacute;odo</font>
        <hr width="50%" size=7 color="black">
    <p align="center">
        <img src="img2.jpeg">
    </p>

    <ul align="center" type="none">
        <li>
            <font size=5>L&iacute;ngua Inglesa II</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Estrat&eacute;gias de leitura de textos com l&eacute;xico computacional: infer&ecirc;ncias a
                        partir da an&aacute;lise de<br>
                        t&iacute;tulos, gr&aacute;ficos, ilustra&ccedil;&otilde;es, acionamento do conhecimento
                        pr&eacute;vio sobre o tema, vocabul&aacute;rio cognato e<br>
                        o significado do vocabul&aacute;rio desconhecido a partir do contexto.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>C&aacute;lculo Aplicado &agrave; Inform&aacute;tica</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Introdu&ccedil;&atilde;o &agrave; Fun&ccedil;&otilde;es, Limites, Derivada, Integral e S&eacute;ries.
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Algoritmos e Estrutura de Dados</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Tipos de dados. Manipula&ccedil;&atilde;o de estrutura de dados. Algoritmos de busca. &Aacute;rvores no<br>
                        balanceamento de dados. Recursividade em programas modulares.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Processo de Software</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Processo de Software. Modelos Tradicionais de Ciclo de Vida de Desenvolvimento de<br>
                        Software. M&eacute;todos &Aacute;geis de Desenvolvimento de Software.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Introdu&ccedil;&atilde;o &agrave; Geometria Anal&iacute;tica e &Aacute;lgebra Linear</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Matrizes. Sistemas lineares. &Aacute;lgebra vetorial. Retas e planos. Espa&ccedil;os vetoriais.<br>
                        Transforma&ccedil;&otilde;es lineares. Produto interno. Autovalores e autovetores. C&ocirc;nicas e qu&aacute;dricas.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Organiza&ccedil;&atilde;o e Arquitetura de Computadores</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Estrutura b&aacute;sica de organiza&ccedil;&atilde;o e funcionamento de um computador. Vis&atilde;o do<br>
                        funcionamento, das partes internas de um computador, o relacionamento de cada componente e suas<br>
                        identifica&ccedil;&otilde;es, suas fun&ccedil;&otilde;es e interdepend&ecirc;ncias entre hardware e software. Estrutura de funcionamento<br>
                        do processador, mem&oacute;ria, registradores, barramento. Fluxo de dados internos, controle e administra&ccedil;&atilde;o<br>
                        do processamento de dados. Formata&ccedil;&otilde;es internas de dados. No&ccedil;&otilde;es de arquiteturas RISC e CISC.<br>
                        Padr&otilde;es de arquiteturas. Introdu&ccedil;&atilde;o a arquiteturas dedicadas. Multiprocessadores. Multicomputadores.<br>
                    </p>
                </li>
            </ul>
        </li>
    </ul>
    </p>

    <br>
    <br>
    <br>

    <p align="center" id="p3">
        <font size=7 color="red">3 Per&iacute;odo</font>
        <hr width="50%" size=7 color="black">
    <p align="center">
        <img src="img3.jpg">
    </p>

    <ul align="center" type="none">
        <li>
            <font size=5>L&iacute;ngua Inglesa III</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Estrat&eacute;gias de leitura de textos com l&eacute;xico computacional: infer&ecirc;ncias a partir da an&aacute;lise de<br>
                        t&iacute;tulos, gr&aacute;ficos, ilustra&ccedil;&otilde;es, acionamento do conhecimento pr&eacute;vio sobre o tema, vocabul&aacute;rio cognato e<br>
                        o significado do vocabul&aacute;rio desconhecido a partir do contexto.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Programa&ccedil;&atilde;o Orientada &agrave; Objetos</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Conceitos b&aacute;sicos de orienta&ccedil;&atilde;o a objetos. Cole&ccedil;&otilde;es. Manipula&ccedil;&atilde;o de Strings. Comunica&ccedil;&atilde;o<br>
                        com o banco de dados. Heran&ccedil;a. Tratamento de exce&ccedil;&otilde;es. Interface gr&aacute;fica com o usu&aacute;rio.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Estat&iacute;stica e Probabilidade Aplicada</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: An&aacute;lise, representa&ccedil;&atilde;o e sumariza&ccedil;&atilde;o de dados de forma descritiva. Estimativa de par&acirc;metros.<br>
                        Teste de hip&oacute;teses. Estudo de agrupamentos e constru&ccedil;&atilde;o de modelos probabil&iacute;sticos.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Sistemas Operacionais</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Fundamentos de sistemas operacionais. Fun&ccedil;&otilde;es e caracter&iacute;sticas de um SO. Tipos de<br>
                        Sistemas Operacionais. Monoprocessamento e Multiprocessamento. Estrutura do Sistema Operacional.<br>
                        O n&uacute;cleo do sistema. Conceitos de processos. Ger&ecirc;ncia de Dispositivos de E/S. Gerenciamento de<br>
                        mem&oacute;ria. Mem&oacute;ria virtual. Gerenciamento de arquivos. Sistemas de arquivos. Linux. Desktops Linux.<br>
                        Licenciamento. Distribui&ccedil;&otilde;es. Comandos Linux. Instala&ccedil;&atilde;o do Linux. Gerenciamento de usu&aacute;rios,<br>
                        Configura&ccedil;&atilde;o de perif&eacute;ricos no Linux. Instala&ccedil;&atilde;o de programas no Linux. Windows 10. Comandos<br>
                        Windows. Configura&ccedil;&atilde;o de perif&eacute;ricos no Windows. Gerenciamento de usu&aacute;rios no Windows 10.<br>
                        Instala&ccedil;&atilde;o de programas no Windows.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Banco de Dados I</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Contexto hist&oacute;rico e motiva&ccedil;&atilde;o para o surgimento e uso de banco de dados. Aplica&ccedil;&otilde;es de<br>
                        banco de dados. Sistemas de Arquivo. Vis&atilde;o geral de um Sistema Gerenciador de Banco de Dados.<br>
                        T&eacute;cnicas de Modelagem de dados. Modelo Entidade Relacionamento. Modelo Relacional.<br>
                        Normaliza&ccedil;&atilde;o. Projeto de Banco de Dados. SQL. XML.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Engenharia de Requisito</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Requisitos de Software. Processo da Engenharia de Requisitos de Software. T&eacute;cnicas de<br>
                        Elicita&ccedil;&atilde;o de Requisitos. An&aacute;lise de requisitos e modelagem conceitual de sistemas: m&eacute;todos e<br>
                        t&eacute;cnicas. Especifica&ccedil;&atilde;o de Requisitos. Verifica&ccedil;&atilde;o e Valida&ccedil;&atilde;o de requisitos. Ger&ecirc;ncia de requisitos.<br>
                        Reutiliza&ccedil;&atilde;o de requisitos. Ferramentas.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Metodologia Cient&iacute;fica</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Introdu&ccedil;&atilde;o a metodologia de pesquisa. Conceitos b&aacute;sicos da pesquisa cient&iacute;fica. Est&aacute;gios da<br>
                        pesquisa cient&iacute;fica. Reda&ccedil;&atilde;o cient&iacute;fica e prepara&ccedil;&atilde;o de artigos cient&iacute;ficos.<br>
                    </p>
                </li>
            </ul>
        </li>
    </ul>
    </p>

    <br>
    <br>
    <br>

    <p align="center" id="p4">
        <font size=7 color="red">4 Per&iacute;odo</font>
        <hr width="50%" size=7 color="black">
    <p align="center">
        <img src="img4.jpg">
    </p>

    <ul align="center" type="none">
        <li>
            <font size=5>L&iacute;ngua Inglesa IV</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Estrat&eacute;gias de leitura de textos com l&eacute;xico computacional: infer&ecirc;ncias a partir da an&aacute;lise de<br>
                        t&iacute;tulos, gr&aacute;ficos, ilustra&ccedil;&otilde;es, acionamento do conhecimento pr&eacute;vio sobre o tema, vocabul&aacute;rio cognato e<br>
                        o significado do vocabul&aacute;rio desconhecido a partir do contexto.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Redes de Computadores I</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Contexto hist&oacute;rico e motiva&ccedil;&atilde;o para o surgimento e uso das redes. Aplica&ccedil;&otilde;es das redes de<br>
                        computadores. Classifica&ccedil;&atilde;o das redes quanto &agrave; topologia e &aacute;rea de cobertura. Software e Hardware de<br>
                        Rede. Unidades de medida e desempenho de redes. Modelos de Refer&ecirc;ncia de redes: OSI e TCP/IP.<br>
                        Vis&atilde;o geral do funcionamento da Internet e seus servi&ccedil;os. Outras redes de computadores. Detalhes da<br>
                        camada f&iacute;sica. Detalhes da camada de enlace com estudos de caso em tecnologias mais usadas.<br>
                        Detalhes da camada de rede e do protocolo IP, ARP e ICMP<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Desenvolvimento Web</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Conceitos do desenvolvimento de aplica&ccedil;&otilde;es Web. Linguagens de marca&ccedil;&atilde;o de texto.<br>
                        Linguagem de estilo para a Web. Linguagens de script para desenvolvimento de p&aacute;ginas web<br>
                        din&acirc;micas. Integra&ccedil;&atilde;o de aplica&ccedil;&otilde;es web com bancos de dados. Hospedagem de p&aacute;ginas web.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Economia para Engenharia de Software</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Conhecimentos gerais sobre o estudo da economia com foco no mercado de software.<br>
                        Principais elementos envolvidos no processo de planejamento, desenvolvimento, implementa&ccedil;&atilde;o e<br>
                        avalia&ccedil;&atilde;o de solu&ccedil;&otilde;es computacionais.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Projeto de Software</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Introdu&ccedil;&atilde;o aos conceitos fundamentais de projeto de software. Modelos de projeto de<br>
                        software. Padr&otilde;es de projeto de software. Nota&ccedil;&otilde;es de projeto de software. Aplica&ccedil;&atilde;o de m&eacute;todos e<br>
                        estrat&eacute;gias de projeto de software. Ferramentas de projeto.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Intera&ccedil;&atilde;o humano-computador</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: An&aacute;lise da evolu&ccedil;&atilde;o e multidisciplinaridade em IHC. Defini&ccedil;&atilde;o dos conceitos b&aacute;sicos de<br>
                        IHC. Estudo sobre as principais abordagens te&oacute;ricas de IHC. Estudo sobre os processos de design de<br>
                        IHC. Estudo de m&eacute;todos e t&eacute;cnicas de avalia&ccedil;&atilde;o de IHC.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Banco de Dados II</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: SQL Avan&ccedil;ado. Aspectos Operacionais de SGBD (Seguran&ccedil;a em banco de dados. Restri&ccedil;&otilde;es<br>
                        de Integridade. Transa&ccedil;&otilde;es em Banco de Dados. Controle de Concorr&ecirc;ncia em Banco de Dados).<br>
                        Contexto hist&oacute;rico e motiva&ccedil;&atilde;o para o surgimento e uso de banco de dados avan&ccedil;ados. Aplica&ccedil;&otilde;es de<br>
                        banco de dados avan&ccedil;ados. Data Warehouse. Banco de Dados Orientados a Objetos. Modelo ER<br>
                        Estendido.<br>
                    </p>
                </li>
            </ul>
        </li>
    </ul>
    </p>

    <br>
    <br>
    <br>

    <p align="center" id="p5">
        <font size=7 color="red">5 Per&iacute;odo</font>
        <hr width="50%" size=7 color="black">
    <p align="center">
        <img src="img5.jpg">
    </p>

    <ul align="center" type="none">
        <li>
            <font size=5>L&iacute;ngua Inglesa V</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Estrat&eacute;gias de leitura de textos com l&eacute;xico computacional: infer&ecirc;ncias a partir da an&aacute;lise de<br>
                        t&iacute;tulos, gr&aacute;ficos, ilustra&ccedil;&otilde;es, acionamento do conhecimento pr&eacute;vio sobre o tema, vocabul&aacute;rio cognato e<br>
                        o significado do vocabul&aacute;rio desconhecido a partir do contexto.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Redes de Computadores II</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Aprofundamento do estudo da camada de Rede. Roteamento e algoritmos de roteamento.<br>
                        Detalhes sobre as funcionalidades da camada de transporte. TCP: estabelecimento da conex&atilde;o,<br>
                        mecanismo de reconhecimento, janela deslizante, controle de fluxo, controle de congestionamento.<br>
                        UDP. Introdu&ccedil;&atilde;o &agrave; programa&ccedil;&atilde;o com Sockets. Protocolos de aplica&ccedil;&atilde;o: DNS, FTP, SMTP, POP,<br>
                        HTTP. Desenvolvimento de aplica&ccedil;&otilde;es e servi&ccedil;os utilizando protocolos da camada de aplica&ccedil;&atilde;o.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Programa&ccedil;&atilde;o para Dispositivos M&oacute;veis</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Compreens&atilde;o das principais caracter&iacute;sticas sobre dispositivos m&oacute;veis. Conhecimento das<br>
                        plataformas de desenvolvimento mais utilizadas. Entendimento da arquitetura de Software M&oacute;vel.<br>
                        Reconhecimento dos principais m&eacute;todos de comunica&ccedil;&atilde;o para Software m&oacute;vel.<br>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Ger&ecirc;ncia de Projetos de Software</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Planejamento e controle de processos de software. T&eacute;cnicas para estimativa de projetos.<br>
                        Planos de desenvolvimento de software. Acompanhamento e controle de projetos. Principais riscos dos<br>
                        projetos de software. Princ&iacute;pios b&aacute;sicos da melhoria de processos de software. Estrat&eacute;gias para<br>
                        melhoria de processos de software. Modelos e normas de qualidade aplicados a software. Plano da<br>
                        qualidade de software.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Modelagem de Processos de Neg&oacute;cio</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: 1-Processos de Neg&oacute;cio. 2-Introdu&ccedil;&atilde;o a Gest&atilde;o de Processos. 3-Projeto de Modelagem de<br>
                        Processos. 4-Levantamento de Processos. 5-Nota&ccedil;&atilde;o BPMN. 6-Passo-a-passo para constru&ccedil;&atilde;o do<br>
                        modelo de processos de neg&oacute;cio. 7-Aplica&ccedil;&otilde;es de BPM.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Padr&otilde;es de Projeto de Software OO</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Introdu&ccedil;&atilde;o aos padr&otilde;es de projeto orientados a objetos. Classifica&ccedil;&atilde;o dos padr&otilde;es de projeto<br>
                        orientados a objetos. Cat&aacute;logo dos padr&otilde;es de projeto orientados a objetos. Utiliza&ccedil;&atilde;o dos padr&otilde;es de<br>
                        projeto orientados a objetos.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Arquitetura de Software</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Defini&ccedil;&atilde;o de arquitetura de software. Import&acirc;ncia e impacto em um software. Estilos<br>
                        arquiteturais (pipeand-filter, camadas, transa&ccedil;&otilde;es, publish-subscribe, baseado em eventos, cliente-<br>
                        servidor, MVC e outros). Rela&ccedil;&atilde;o custo/benef&iacute;cio entre atributos e op&ccedil;&otilde;es arquiteturais. Quest&otilde;es de<br>
                        hardware em projeto de software. Rastreabilidade de requisitos e arquitetura de software. Arquiteturas<br>
                        espec&iacute;ficas de um dom&iacute;nio e linhas de produto. Nota&ccedil;&otilde;es arquiteturais (vis&otilde;es, representa&ccedil;&otilde;es,<br>
                        diagramas de componentes e outros). Reutiliza&ccedil;&atilde;o.<br>
                    </p>
                </li>
            </ul>
        </li>
    </ul>
    </p>

    <br>
    <br>
    <br>

    <p align="center" id="p6">
        <font size=7 color="red">6 Per&iacute;odo</font>
        <hr width="50%" size=7 color="black">
    <p align="center">
        <img src="img6.jpg">
    </p>

    <ul align="center" type="none">
        <li>
            <font size=5>L&iacute;ngua Inglesa VI</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Estrat&eacute;gias de leitura de textos com l&eacute;xico computacional: infer&ecirc;ncias a partir da an&aacute;lise de<br>
                        t&iacute;tulos, gr&aacute;ficos, ilustra&ccedil;&otilde;es, acionamento do conhecimento pr&eacute;vio sobre o tema, vocabul&aacute;rio cognato e<br>
                        o significado do vocabul&aacute;rio desconhecido a partir do contexto.<br>.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Verifica&ccedil;&atilde;o e Valida&ccedil;&atilde;o de Software</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Introdu&ccedil;&atilde;o a verifica&ccedil;&atilde;o e valida&ccedil;&atilde;o de software. Teste de software. Projeto e documenta&ccedil;&atilde;o<br>
                        de teste. Teste de sistemas cr&iacute;ticos. Ferramentas para automa&ccedil;&atilde;o de testes.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Sistemas Paralelos e Distribu&iacute;dos</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Conceitos b&aacute;sicos de sistemas distribu&iacute;dos; Paradigmas de linguagens de programa&ccedil;&atilde;o<br>
                        distribu&iacute;da; Ambientes de suporte ao desenvolvimento de sistemas distribu&iacute;dos. Introdu&ccedil;&atilde;o &agrave;s<br>
                        Plataformas de Distribui&ccedil;&atilde;o. Caracter&iacute;sticas B&aacute;sicas das Plataformas de Distribui&ccedil;&atilde;o.<br>
                        Middleware para chamadas e invoca&ccedil;&atilde;o remota. Middleware para objetos e componentes<br>
                        distribu&iacute;dos. Introdu&ccedil;&atilde;o aos Servi&ccedil;os Web. Desenvolvimento de aplica&ccedil;&otilde;es de Servi&ccedil;os Web.<br>
                        Introdu&ccedil;&atilde;o &agrave; computa&ccedil;&atilde;o em nuvem. Desenvolvimento de aplica&ccedil;&otilde;es em nuvem utilizando<br>
                        plataformas e infraestruturas de mercado.<br>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Qualidade de Software</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Compreens&atilde;o da qualidade de processo e de produto. Classifica&ccedil;&atilde;o de processos.<br>
                        Gerenciamento de medi&ccedil;&atilde;o de processos. Realiza&ccedil;&atilde;o de an&aacute;lise e modelagem de processos.<br>
                        Compreens&atilde;o das mudan&ccedil;as e melhorias de processos.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Ger&ecirc;ncia de Configura&ccedil;&atilde;o e Mudan&ccedil;a</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Ciclo de Vida de Produtos e Artefatos. No&ccedil;&otilde;es de Gerenciamento de Configura&ccedil;&otilde;es de<br>
                        Artefatos e Produtos. No&ccedil;&otilde;es sobre Controle de Mudan&ccedil;as. Principais Ferramentas. No&ccedil;&otilde;es sobre<br>
                        Integra&ccedil;&atilde;o Cont&iacute;nua.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Projeto Integrador</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Desenvolvimento de um sistema de computa&ccedil;&atilde;o usando conceitos aprendidos anteriormente.<br>
                        Sistemas multidisciplinares devem ser estimulados bem como o trabalho em equipe.<br>
                    </p>
                </li>
            </ul>
        </li>
    </ul>
    </p>

    <br>
    <br>
    <br>

    <p align="center" id="p7">
        <font size=7 color="red">7 Per&iacute;odo</font>
        <hr width="50%" size=7 color="black">
    <p align="center">
        <img src="img7.jpg">
    </p>

    <ul align="center" type="none">
        <li>
            <font size=5>Metodologia da Pesquisa I</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Elabora&ccedil;&atilde;o de proposta de trabalho cient&iacute;fico e/ou tecnol&oacute;gico, envolvendo temas abrangidos<br>
                        pelo curso
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>VEmpreendedorismo e Inova&ccedil;&atilde;o</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Desenvolvimento da capacidade empreendedora, com &ecirc;nfase na an&aacute;lise do neg&oacute;cio, perfil do<br>
                        empreendedor, sistema de gerenciamento, conceitos de inova&ccedil;&atilde;o, patentes e direitos, t&eacute;cnicas de<br>
                        negocia&ccedil;&atilde;o, planejamento estrat&eacute;gico e administra&ccedil;&atilde;o estrat&eacute;gica, qualidade e competitividade.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Seguran&ccedil;a e Auditoria de Sistemas</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Fundamentos de seguran&ccedil;a para sistemas de informa&ccedil;&atilde;o. Prote&ccedil;&atilde;o da informa&ccedil;&atilde;o. Gest&atilde;o de<br>
                        vulnerabilidade em sistemas de informa&ccedil;&atilde;o. No&ccedil;&otilde;es de auditoria de sistemas de informa&ccedil;&atilde;o.<br>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Engenharia de Software Educacional</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Introdu&ccedil;&atilde;o &agrave; &aacute;rea de software educacional. Processos de desenvolvimento de software<br>
                        educacional. Projeto de software educacional. Ferramentas/frameworks de desenvolvimento para<br>
                        software educacional. Aspectos pedag&oacute;gicos para o desenvolvimento de software educacional.<br>
                        Usabilidade e acessibilidade para o desenvolvimento de software educacional. Desafios e tend&ecirc;ncias<br>
                        para a &aacute;rea de engenharia de software educacional.<br>
                    </p>
                </li>
            </ul>
        </li>
    </ul>
    </p>

    <br>
    <br>
    <br>

    <p align="center" id="p8">
        <font size=7 color="red">8 Per&iacute;odo</font>
        <hr width="50%" size=7 color="black">
    <p align="center">
        <img src="img8.jpg">
    </p>

    <ul align="center" type="none">
        <li>
            <font size=5>Metodologia da Pesquisa II</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Elabora&ccedil;&atilde;o de proposta de trabalho cient&iacute;fico e/ou tecnol&oacute;gico, envolvendo temas abrangidos<br>
                        pelo curso
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Eng. de Software para Desenvolvimento de Jogos</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Desenvolvimento da capacidade empreendedora, com &ecirc;nfase na an&aacute;lise do neg&oacute;cio, perfil do<br>
                        empreendedor, sistema de gerenciamento, conceitos de inova&ccedil;&atilde;o, patentes e direitos, t&eacute;cnicas de<br>
                        negocia&ccedil;&atilde;o, planejamento estrat&eacute;gico e administra&ccedil;&atilde;o estrat&eacute;gica, qualidade e competitividade.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>Introdu&ccedil;&atilde;o aos Sistemas Inteligentes</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Fundamentos de seguran&ccedil;a para sistemas de informa&ccedil;&atilde;o. Prote&ccedil;&atilde;o da informa&ccedil;&atilde;o. Gest&atilde;o de<br>
                        vulnerabilidade em sistemas de informa&ccedil;&atilde;o. No&ccedil;&otilde;es de auditoria de sistemas de informa&ccedil;&atilde;o.<br>
                    </p>
                </li>
            </ul>
        </li>
    </ul>
    </p>

    <br>
    <br>
    <br>

    <p align="center" id="optativa">
        <font size=7 color="red">optativas</font>
        <hr width="50%" size=7 color="black">
    <p align="center">
        <img src="img9.png">
    </p>

    <ul align="center" type="none">
        <li>
            <font size=5>Libras</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Conceito de surdez. Estudo sobre os principais aspectos da L&iacute;ngua Brasileira de Sinais &ndash;<br>
                        LIBRAS, suas contribui&ccedil;&otilde;es para a inclus&atilde;o dos alunos surdos no &acirc;mbito da escola e seus<br>
                        par&acirc;metros. As diferentes l&iacute;nguas de sinais; Status da l&iacute;ngua de sinais no Brasil; Cultura e<br>
                        Identidade surda; Hist&oacute;ria da Educa&ccedil;&atilde;o dos Surdos. Diferentes abordagens na hist&oacute;ria da<br>
                        educa&ccedil;&atilde;o dos surdos. Legisla&ccedil;&atilde;o espec&iacute;fica. O uso da LIBRAS em contexto<br>
                        escolares e n&atilde;o-escolares.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>T&oacute;picos Avan&ccedil;ados em Banco de Dados I</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Disciplina com ementa flex&iacute;vel permitindo a abordagem de temas relevantes e atuais na &aacute;rea<br>
                        de Banco de Dados, de interesse para a forma&ccedil;&atilde;o do profissional da &aacute;rea que: ou n&atilde;o<br>
                        tenham sido incorporados aos conte&uacute;dos program&aacute;ticos das demais disciplinas do curso ou<br>
                        que precisem ser mais aprofundados.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>T&oacute;picos Avan&ccedil;ados em Banco de Dados II</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Disciplina com ementa flex&iacute;vel permitindo a abordagem de temas relevantes e atuais na &aacute;rea<br>
                        de Banco de Dados, de interesse para a forma&ccedil;&atilde;o do profissional da &aacute;rea que: ou n&atilde;o<br>
                        tenham sido incorporados aos conte&uacute;dos program&aacute;ticos das demais disciplinas do curso ou<br>
                        que precisem ser mais aprofundados.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>T&oacute;picos Avan&ccedil;ados em Programa&ccedil;&atilde;o I</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Projeto de software em diversos paradigmas: Orientado a Objetos; Imperativo; Web; Em<br>
                        nuvem; Software especialista; Software embarcado e Projeto de Software Avan&ccedil;ado. Tamb&eacute;m<br>
                        ser&atilde;o estudados aspectos referentes &agrave;: otimiza&ccedil;&atilde;o de software; programa&ccedil;&atilde;o<br>
                        paralela e leitura.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>T&oacute;picos Avan&ccedil;ados em Programa&ccedil;&atilde;o II</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Reuso de software; Desenvolvimento baseado em componentes (DBC); Projeto de Software;<br>
                        Engenharia de Dom&iacute;nio; Processos de Reuso; Desenvolvimento em F&aacute;brica de Software;<br>
                        Leitura e Discuss&atilde;o de Artigos.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>T&oacute;picos Avan&ccedil;ados em Redes de Computadores I</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Propiciar embasamento te&oacute;rico avan&ccedil;ado de interconex&atilde;o de redes, com<br>
                        demonstra&ccedil;&otilde;es pr&aacute;ticas em ambiente de simula&ccedil;&atilde;o, considerando os principais<br>
                        protocolos de roteamento, bem como enfatizar os algoritmos adotados em cada protocolo.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>T&oacute;picos Avan&ccedil;ados em Redes de Computadores II</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Oportunizar entendimento acerca dos sistemas de comunica&ccedil;&atilde;o sem fio em redes de<br>
                        computadores, com base nas principais tecnologias da fam&iacute;lia IEEE 802.1x e similares.<br>
                        Propiciar a assimila&ccedil;&atilde;o do conte&uacute;do por meio de projetos de redes de comunica&ccedil;&atilde;o<br>
                        sem fio em ambientes de simula&ccedil;&atilde;o.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>T&oacute;picos Avan&ccedil;ados em Intera&ccedil;&atilde;o Humano-Computador I</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Usabilidade Avan&ccedil;ada; Estudos com Usu&aacute;rios; Intera&ccedil;&atilde;o em Sistemas Web; Intera&ccedil;&atilde;o<br>
                        em Dispositivos M&oacute;veis; Novas M&iacute;dias; Intera&ccedil;&atilde;o na Ind&uacute;stria; Projeto de Usabilidade;<br>
                        Leitura e Discuss&atilde;o de Artigos.<br>
                    </p>
                </li>
            </ul>
        </li>
        <li>
            <font size=5>T&oacute;picos Avan&ccedil;ados em Intera&ccedil;&atilde;o Humano-Computador II</font>
            <ul align="center" type="none">
                <li>
                    <p color="red">
                        Ementa: Realidade Virtual e Aumentada; Intera&ccedil;&atilde;o Natural; IHC em Jogos; IHC e computa&ccedil;&atilde;o<br>
                        musical; Impress&atilde;o 3D, IOT, Sistemas de Intera&ccedil;&atilde;o; Leitura e Discuss&atilde;o de Artigos.<br>
                    </p>
                </li>
            </ul>
        </li>
    </ul>
    </p>

    <br>
    <br>
    <br>

    


</body>

</html>